# Limpieza de DF de Proyecto

## Limpieza


1. ✔️Convención de nomenclatura: minúscula y _ en vez de espacios 
2. ✔️Estandarización de booleanos : Y/N(general), F/M(gender) 
3. ✔️Eliminar columnas no necesarias: standard_hours, number_children, salary, over18, employee_count.
3. ✔️(b) Borrar same_as_monthly_income por estar repetida. Y years_in_current_role solo hay 34 datos. date_birth borrada pq nos quedamos con age
4. ✔️Algunas columnas, como la columna DailyRate son columnas que incluyen valores numéricos decimales. Pero en el DataFrame aparece como columna de tipo string. Deberás ahcer los cambios necesarios para convertirla en columna de tipo numérica.
5. ✔️Evaluar si hay valores duplicados y analizar si tiene sentido eliminarlos o mantenerlos
6. ✔️Valores inconsistentes, por ejemplo en la columna DistanceFromHome tiene valores negativos.
7. Errores tipográficos en algunos valores de las columnas categóricas. Por ejemplo, en la columna MaritalStatus en vez de "Married" en algunas filas aparece "Marreid".
8. ✔️Columnas redundantes, es decir, columnas que nos dan la misma información expresada de forma diferente.
9. Redondear a dos decimales (DistanceFromHome...) 
10. DistanceFromHome numero negativo
11. EmployeeNumber tiene nulos, ¿id + indice?
12. ✔️Todos los salarios  quitar $ y pasar tipo a int
13. ✔️Salario no válido, cantidad
14. ✔️JobRole estandarizar mayusculas
16. ✔️DateBirth cambiar a Year (nos interesa la edad) (borramos directamente)
17. ✔️WorkLifeBalance yperformance_rating quitar decimal
18. Nulos de cada columna

In [1]:
import pandas as pd
import numpy as np
import re

In [2]:
rh  = pd.read_csv("HR_RAW_DATA.csv", index_col = 0)
pd.set_option("display.max.columns", None)

In [3]:
rh.sample(15)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
236,45,No,NaN,"538,0$",NaN,1,4,NaN,1,"1553,0",1,0,66,3,3,HeAlTHCare RePrEsenTatIve,2,Divorced,NaN,20933,1,NaN,NaN,12,"3,0",1,NaN,3,NaN,4,"3,0",10,NaN,7,7,NaN,1978,1000000000$,NaN,NaN,1
1520,23,No,NaN,"1309,0$",NaN,-22,1,NaN,1,"465,0",3,0,83,3,1,rEseaRCH sCIENtIst,4,NaN,"2904,0",16092,1,Y,NaN,12,"3,0",3,NaN,2,NaN,2,"2,0",4,NaN,0,2,"2904,0",2000,1000000000$,NaN,NaN,0
921,44,No,travel_rarely,"1315,0$",NaN,3,4,NaN,1,"671,0",4,0,35,3,5,MaNaGeR,4,NaN,"19513,0",9358,4,Y,NaN,12,"3,0",1,NaN,1,"26,0",2,"4,0",2,NaN,0,1,"19513,0",1979,1000000000$,NaN,NaN,Yes
25,35,No,NaN,"607,0$",NaN,9,3,Life Sciences,1,NaN,4,1,66,2,3,manUfACtURing dirEctOR,3,Married,NaN,23457,1,Y,Yes,20,"4,0",2,"80,0",1,"17,0",2,"3,0",17,NaN,5,15,NaN,1988,1000000000$,NaN,NaN,False
911,29,No,travel_rarely,"232,0$",NaN,19,3,Technical Degree,1,"611,0",4,0,34,3,2,MAnUfACturINg DIrecTOR,4,Divorced,"4262,0",22645,4,Y,No,12,"3,0",2,NaN,2,"8,0",2,"4,0",3,"2,0",1,2,"4262,0",1994,1000000000$,NaN,NaN,Yes
1387,42,No,NaN,"603,0$",NaN,-34,4,Medical,1,NaN,2,1,78,4,2,REsearCH sCIeNTIst,2,Married,"2372,0",5628,6,Y,Yes,16,"3,0",4,NaN,0,"18,0",2,"3,0",1,NaN,0,0,"2372,0",1981,1000000000$,NaN,NaN,0
1045,37,No,NaN,"1462,0$",NaN,11,3,Medical,1,"1411,0",1,1,94,3,1,labORATory teCHNiCian,3,Single,"3629,0",19106,4,NaN,No,18,"3,0",1,"80,0",0,"8,0",6,"3,0",3,NaN,0,2,"3629,0",1986,1000000000$,NaN,NaN,True
583,41,No,travel_rarely,"483,0$",NaN,6,3,NaN,1,"466,0",4,0,Not Available,2,2,MAnUFacTuRING DIREctOR,2,Single,NaN,10110,6,NaN,Yes,15,"3,0",4,NaN,0,NaN,3,"3,0",5,NaN,1,2,NaN,1982,1000000000$,NaN,NaN,Yes
749,32,No,NaN,nan$,NaN,7,5,Marketing,1,"1446,0",4,0,97,3,2,SalEs EXeCutiVe,4,NaN,"9204,0",23343,4,NaN,NaN,12,"3,0",3,"80,0",1,"7,0",3,NaN,4,NaN,0,3,"9204,0",1991,1000000000$,NaN,NaN,Yes
1508,27,No,travel_rarely,"511,0$",Sales,2,2,NaN,1,"1898,0",1,1,89,4,2,SALes eXEcUtiVe,3,Single,NaN,26997,0,Y,No,14,"3,0",2,NaN,0,"9,0",5,"2,0",8,NaN,0,7,NaN,1996,1000000000$,SALes eXEcUtiVe - Sales,NaN,True
1494,27,No,travel_rarely,"199,0$",NaN,6,3,NaN,1,"1162,0",4,0,55,2,1,reseArCH ScIeNTiSt,3,Married,"2539,0",7950,1,Y,No,13,NaN,3,NaN,1,"4,0",0,"3,0",4,"2,0",2,2,"2539,0",1996,1000000000$,NaN,NaN,0
217,49,No,NaN,"174,0$",NaN,8,4,NaN,1,"1138,0",4,0,56,2,4,sales ExecuTiVe,2,NaN,"13120,0",11879,6,Y,NaN,17,"3,0",2,"80,0",1,"22,0",3,"3,0",9,NaN,2,3,"13120,0",1974,1000000000$,NaN,NaN,False
1151,54,No,NaN,nan$,NaN,10,3,NaN,1,"1980,0",3,1,77,3,2,manuFacTurING DIrector,1,Single,"4440,0",25198,6,Y,Yes,19,NaN,4,NaN,0,"9,0",3,"3,0",5,NaN,1,4,"4440,0",1969,1000000000$,NaN,NaN,False
937,29,No,NaN,"1090,0$",Sales,10,3,NaN,1,NaN,4,0,83,3,1,SaLes rePrESENTaTivE,2,NaN,"2297,0",17967,1,Y,No,14,"3,0",4,"80,0",2,NaN,2,"3,0",2,NaN,2,2,"2297,0",1994,1000000000$,SaLes rePrESENTaTivE - Sales,NaN,0
332,37,No,travel_rarely,"482,0$",NaN,3,3,Other,1,NaN,3,0,36,3,3,MaNUfaCtURinG DiRectoR,3,Married,"9434,0",9606,1,NaN,No,15,NaN,3,"80,0",1,NaN,2,"3,0",10,NaN,7,8,"9434,0",1986,1000000000$,NaN,NaN,1

# Estandarizamos los nombres de columnas: todo en minúsculas y espacios como _

In [4]:
# Primer paso: las columnas de todo en mayuscula, pasamos a minúsculas y separamos las palabras#

rh.rename(columns={'NUMCOMPANIESWORKED':'num_companies_worked', 'TOTALWORKINGYEARS':'total_working_years', 'WORKLIFEBALANCE':'work_life_balance','YEARSWITHCURRMANAGER':'years_with_curr_manager','NUMBERCHILDREN':'number_children'},inplace = True)

In [5]:
rh

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,num_companies_worked,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,total_working_years,TrainingTimesLastYear,work_life_balance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,years_with_curr_manager,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,number_children,RemoteWork
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",3,0,58,3,5,ManaGER,4,Married,"19232,0",4933,1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,1,1,82,3,4,ReseArCH DIrECtOr,3,Married,"17169,0",26703,3,Y,NaN,19,"3,0",2,NaN,2,NaN,2,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,NaN,1,1,45,4,4,sAleS EXECUtIve,1,Divorced,NaN,7739,2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,36,Yes,travel_rarely,"530,0$",NaN,3,1,Life Sciences,1,"967,0",3,0,51,2,3,saLEs ExeCUTiVe,4,Married,"10325,0",5518,1,Y,NaN,11,NaN,1,NaN,1,NaN,6,"3,0",16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,45,No,non-travel,"805,0$",NaN,4,2,NaN,1,"972,0",3,0,57,3,2,LAboRaTOry tECHNiCIAn,2,NaN,"4447,0",23163,1,NaN,NaN,12,"3,0",2,NaN,0,NaN,5,"2,0",9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,39,No,travel_rarely,"903,0$",NaN,-13,5,NaN,1,NaN,13,0,41,4,3,sAlES ExECUTivE,3,Single,NaN,2560,0,NaN,No,18,"3,0",4,NaN,0,"9,0",3,"3,0",8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,36,No,non-travel,"1229,0$",NaN,8,4,Technical Degree,1,"990,0",1,0,84,3,2,SaLes ExecUtIVe,4,Divorced,NaN,25952,4,NaN,No,13,NaN,4,NaN,2,"12,0",3,"3,0",7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,46,No,NaN,"566,0$",NaN,7,2,Medical,1,NaN,4,0,75,3,3,mAnUfactURInG DiRECTOr,3,NaN,"10845,0",24208,6,Y,NaN,13,"3,0",2,NaN,1,NaN,3,"3,0",8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

In [6]:
# Segundo paso:todo en minuscula, añadir barra baja separadora

# Patrón regex para identificar la transición de minúsculas a mayúsculas
patron = '(?<=[a-z])(?=[A-Z])'

# Diccionario para almacenar los nuevos nombres de columna
columnas = {column: re.sub(patron,'_', column) for column in rh.columns}

# Renombrar las columnas usando los nuevos nombres
rh.rename(columns=columnas, inplace=True)

# Convertir los nombres de las columnas a minúsculas
rh.columns = [columna.lower() for columna in rh.columns]

#cambiamos manualmente el nombre de una columna
rh.rename(columns = {'employeenumber': 'employee_number', 'employeecount' : 'employee_count'}, inplace = True )

rh

,age,attrition,business_travel,daily_rate,department,distance_from_home,education,education_field,employee_count,employee_number,environment_satisfaction,gender,hourly_rate,job_involvement,job_level,job_role,job_satisfaction,marital_status,monthly_income,monthly_rate,num_companies_worked,over18,over_time,percent_salary_hike,performance_rating,relationship_satisfaction,standard_hours,stock_option_level,total_working_years,training_times_last_year,work_life_balance,years_at_company,years_in_current_role,years_since_last_promotion,years_with_curr_manager,same_as_monthly_income,date_birth,salary,role_departament,number_children,remote_work
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",3,0,58,3,5,ManaGER,4,Married,"19232,0",4933,1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,1,1,82,3,4,ReseArCH DIrECtOr,3,Married,"17169,0",26703,3,Y,NaN,19,"3,0",2,NaN,2,NaN,2,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,NaN,1,1,45,4,4,sAleS EXECUtIve,1,Divorced,NaN,7739,2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,36,Yes,travel_rarely,"530,0$",NaN,3,1,Life Sciences,1,"967,0",3,0,51,2,3,saLEs ExeCUTiVe,4,Married,"10325,0",5518,1,Y,NaN,11,NaN,1,NaN,1,NaN,6,"3,0",16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,45,No,non-travel,"805,0$",NaN,4,2,NaN,1,"972,0",3,0,57,3,2,LAboRaTOry tECHNiCIAn,2,NaN,"4447,0",23163,1,NaN,NaN,12,"3,0",2,NaN,0,NaN,5,"2,0",9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,39,No,travel_rarely,"903,0$",NaN,-13,5,NaN,1,NaN,13,0,41,4,3,sAlES ExECUTivE,3,Single,NaN,2560,0,NaN,No,18,"3,0",4,NaN,0,"9,0",3,"3,0",8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,36,No,non-travel,"1229,0$",NaN,8,4,Technical Degree,1,"990,0",1,0,84,3,2,SaLes ExecUtIVe,4,Divorced,NaN,25952,4,NaN,No,13,NaN,4,NaN,2,"12,0",3,"3,0",7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,46,No,NaN,"566,0$",NaN,7,2,Medical,1,NaN,4,0,75,3,3,mAnUfactURInG DiRECTOr,3,NaN,"10845,0",24208,6,Y,NaN,13,"3,0",2,NaN,1,NaN,3,"3,0",8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

In [7]:
rh.dtypes

age                            object
attrition                      object
business_travel                object
daily_rate                     object
department                     object
distance_from_home              int64
education                       int64
education_field                object
employee_count                  int64
employee_number                object
environment_satisfaction        int64
gender                          int64
hourly_rate                    object
job_involvement                 int64
job_level                       int64
job_role                       object
job_satisfaction                int64
marital_status                 object
monthly_income                 object
monthly_rate                    int64
num_companies_worked            int64
over18                         object
over_time                      object
percent_salary_hike             int64
performance_rating             object
relationship_satisfaction       int64
standard_hours                 object
stock_option_level              int64
total_working_years            object
training_times_last_year        int64
work_life_balance              object
years_at_company                int64
years_in_current_role          object
years_since_last_promotion      int64
years_with_curr_manager         int64
same_as_monthly_income         object
date_birth                      int64
salary                         object
role_departament               object
number_children               float64
remote_work                    object
dtype: object

# Acordar estandarización de booleanos : general: Y/N, genre: F/M

In [8]:
# Para género
rh["gender"].replace(to_replace = [0,1], value = ['M', 'F'], inplace = True)

In [9]:
#Para Y/N
rh["over18"].replace(to_replace = [0,1], value = ['N', 'Y'], inplace = True)
rh[["attrition", "over_time"]]= rh[["attrition", "over_time"]].replace(to_replace = ["No","Yes"], value = ['N', 'Y']) #Borrar

In [10]:

rh["remote_work"].replace(to_replace = ["0","1"], value = ['N', 'Y'], inplace = True)
rh["remote_work"].replace(to_replace = ["No","Yes"], value = ['N', 'Y'], inplace = True)
rh["remote_work"].replace(to_replace = ["False","True"], value = ['N', 'Y'], inplace = True)

#Borramos las columnas inservibles

In [11]:
# .drop standard_hours, number_children, salary, over18, employee_count
rh.drop(labels=["standard_hours", "number_children", "salary", "over18", "employee_count", "years_in_current_role", "same_as_monthly_income", "date_birth"], axis = 1, inplace=True)

# years_in_current_role borrada por tener solo 34 datos: insuficiente
# same_as_monthly_income está repetida

Estandarizamos todos los valores en camel

In [12]:
#creamos variable con todas las columnas object

def camelizar (dato):

    try:
        return dato.title()
    except:
        return dato
    
columnas_object_camel = ["age","attrition","business_travel","daily_rate","department","education_field","employee_number","hourly_rate","job_role","marital_status","monthly_income","over_time","performance_rating","total_working_years","work_life_balance","role_departament","remote_work"]

for columnas in columnas_object_camel:
    rh[columnas]=rh[columnas].apply(camelizar)

In [13]:
rh

,age,attrition,business_travel,daily_rate,department,distance_from_home,education,education_field,employee_number,environment_satisfaction,gender,hourly_rate,job_involvement,job_level,job_role,job_satisfaction,marital_status,monthly_income,monthly_rate,num_companies_worked,over_time,percent_salary_hike,performance_rating,relationship_satisfaction,stock_option_level,total_working_years,training_times_last_year,work_life_balance,years_at_company,years_since_last_promotion,years_with_curr_manager,role_departament,remote_work
0,51,N,NaN,"684,0$",NaN,6,3,NaN,"162,0",1,M,51,3,5,Research Director,3,NaN,"19537,0",6462,7,N,13,"3,0",3,0,NaN,5,"3,0",20,15,15,NaN,Y
1,52,N,NaN,"699,0$",NaN,1,4,Life Sciences,"259,0",3,M,65,2,5,Manager,3,NaN,"19999,0",5678,0,NaN,14,"3,0",1,1,"34,0",5,"3,0",33,11,9,NaN,Y
2,42,N,Travel_Rarely,"532,0$",Research & Development,4,2,Technical Degree,"319,0",3,M,58,3,5,Manager,4,Married,"19232,0",4933,1,N,11,"3,0",4,0,"22,0",3,NaN,22,11,15,Manager - Research & Development,Y
3,47,N,Travel_Rarely,"359,0$",NaN,2,4,Medical,NaN,1,F,82,3,4,Research Director,3,Married,"17169,0",26703,3,NaN,19,"3,0",2,2,NaN,2,NaN,20,5,6,NaN,N
4,46,N,NaN,"1319,0$",NaN,3,3,Technical Degree,NaN,1,F,45,4,4,Sales Executive,1,Divorced,NaN,7739,2,N,12,"3,0",4,1,NaN,5,"3,0",19,2,8,NaN,N
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,36,Y,Travel_Rarely,"530,0$",NaN,3,1,Life Sciences,"967,0",3,M,51,2,3,Sales Executive,4,Married,"10325,0",5518,1,NaN,11,NaN,1,1,NaN,6,"3,0",16,3,7,NaN,N
1610,45,N,Non-Travel,"805,0$",NaN,4,2,NaN,"972,0",3,M,57,3,2,Laboratory Technician,2,NaN,"4447,0",23163,1,NaN,12,"3,0",2,0,NaN,5,"2,0",9,0,8,NaN,Y
1611,39,N,Travel_Rarely,"903,0$",NaN,-13,5,NaN,NaN,13,M,41,4,3,Sales Executive,3,Single,NaN,2560,0,N,18,"3,0",4,0,"9,0",3,"3,0",8,0,7,NaN,Y
1612,36,N,Non-Travel,"1229,0$",NaN,8,4,Technical Degree,"990,0",1,M,84,3,2,Sales Executive,4,Divorced,NaN,25952,4,N,13,NaN,4,2,"12,0",3,"3,0",7,0,7,NaN,Y
1613,46,N,NaN,"566,0$",NaN,7,2,Medical,NaN,4,M,75,3,3,Manufacturing Director,3,NaN,"10845,0",24208,6,NaN,13,"3,0",2,1,NaN,3,"3,0",8,0,7,NaN,N

WorkLifeBalance, performace_rating y monthly_income quitar comas

In [14]:
columnas_sin_comas = ['work_life_balance','performance_rating','monthly_income']
for columna in columnas_sin_comas:
    rh[columna] = rh[columna].str.replace(",",".")

Todos los salarios  quitar $ y pasar tipo a int

In [15]:
columnas_sin_dollar = ['daily_rate']
for columna in columnas_sin_dollar:
    rh[columna] = rh[columna].str.replace('$','').str.replace(",",".")

rh[columna]
rh["daily_rate"]= rh["daily_rate"].astype(float)

/tmp/ipykernel_1126/3247174935.py:3: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  rh[columna] = rh[columna].str.replace('$','').str.replace(",",".")

Sustituimos el Not Available por nan en hourly_rate y convertimos a float:

In [16]:
#rh['work_life_balance'].unique()

In [17]:
# hourly_date
rh['hourly_rate']=rh['hourly_rate'].replace('Not Available', np.nan)
rh['hourly_rate']=rh['hourly_rate'].astype('float', errors='ignore')

In [18]:
rh['hourly_rate'].dtypes

dtype('float64')

In [19]:
#daily_rate = ok
#daily_rate = nan
# performance_rating = nan
# monthly_income = nan

Pasamos a float las columnas de monthly_income, performance_rating y work_life_balance (las demás object). daily_rate(float64)

In [20]:
def pasar_a_float(elemento):
    try:
        return float(elemento)
    except (ValueError, TypeError):
        return np.NaN

lista_columnas = ['monthly_income', 'performance_rating', 'work_life_balance'] 

for columna in lista_columnas:
    rh[columna] = rh[columna].apply(pasar_a_float).astype('float')

# replace de not available por numpyNaN #especificar el texto que sale 
# gestion de nulos
# conversión

## Comprobamos los valores nulos:

In [21]:
info_columnas = pd.concat([(rh.isnull().sum() / rh.shape[0]) * 100, rh.dtypes], axis=1)
info_columnas.columns = ['Porcentaje de Nulos','Tipos de Columnas']
info_columnas

                            Porcentaje de Nulos Tipos de Columnas
age                                    0.000000            object
attrition                              0.000000            object
business_travel                       47.831475            object
daily_rate                             7.682776           float64
department                            81.288724            object
distance_from_home                     0.000000             int64
education                              0.000000             int64
education_field                       46.158612            object
employee_number                       26.703841            object
environment_satisfaction               0.000000             int64
gender                                 0.000000            object
hourly_rate                            5.204461           float64
job_involvement                        0.000000             int64
job_level                              0.000000             int64
job_role                               0.000000            object
job_satisfaction                       0.000000             int64
marital_status                        40.334572            object
monthly_income                        52.230483           float64
monthly_rate                           0.000000             int64
num_companies_worked                   0.000000             int64
over_time                             41.883519            object
percent_salary_hike                    0.000000             int64
performance_rating                    12.081784           float64
relationship_satisfaction              0.000000             int64
stock_option_level                     0.000000             int64
total_working_years                   32.589839            object
training_times_last_year               0.000000             int64
work_life_balance                      6.691450           float64
years_at_company                       0.000000             int64
years_since_last_promotion             0.000000             int64
years_with_curr_manager                0.000000             int64
role_departament                      81.288724            object
remote_work                            0.000000            object

In [29]:
rh.head(3)

,age,attrition,business_travel,daily_rate,department,distance_from_home,education,education_field,employee_number,environment_satisfaction,gender,hourly_rate,job_involvement,job_level,job_role,job_satisfaction,marital_status,monthly_income,monthly_rate,num_companies_worked,over_time,percent_salary_hike,performance_rating,relationship_satisfaction,stock_option_level,total_working_years,training_times_last_year,work_life_balance,years_at_company,years_since_last_promotion,years_with_curr_manager,role_departament,remote_work
0,51,N,NaN,684.0,NaN,6,3,NaN,"162,0",1,M,51.0,3,5,Research Director,3,NaN,19537.0,6462,7,N,13,3.0,3,0,NaN,5,3.0,20,15,15,NaN,Y
1,52,N,NaN,699.0,NaN,1,4,Life Sciences,"259,0",3,M,65.0,2,5,Manager,3,NaN,19999.0,5678,0,NaN,14,3.0,1,1,"34,0",5,3.0,33,11,9,NaN,Y
2,42,N,Travel_Rarely,532.0,Research & Development,4,2,Technical Degree,"319,0",3,M,58.0,3,5,Manager,4,Married,19232.0,4933,1,N,11,3.0,4,0,"22,0",3,NaN,22,11,15,Manager - Research & Development,Y

In [39]:
rh['role_departament'].unique()

array([nan, ' Manager  -  Research & Development ',
       ' Healthcare Representative  -  Research & Development ',
       ' Sales Executive  -  Sales ',
       ' Laboratory Technician  -  Research & Development ',
       ' Manufacturing Director  -  Research & Development ',
       ' Research Scientist  -  Research & Development ',
       ' Research Director  -  Research & Development ',
       ' Human Resources  -  Human Resources ', ' Manager  -  Sales ',
       ' Sales Representative  -  Sales ',
       ' Manager  -  Human Resources '], dtype=object)

# Comprobaciones

In [22]:
rh.dtypes

age                            object
attrition                      object
business_travel                object
daily_rate                    float64
department                     object
distance_from_home              int64
education                       int64
education_field                object
employee_number                object
environment_satisfaction        int64
gender                         object
hourly_rate                   float64
job_involvement                 int64
job_level                       int64
job_role                       object
job_satisfaction                int64
marital_status                 object
monthly_income                float64
monthly_rate                    int64
num_companies_worked            int64
over_time                      object
percent_salary_hike             int64
performance_rating            float64
relationship_satisfaction       int64
stock_option_level              int64
total_working_years            object
training_times_last_year        int64
work_life_balance             float64
years_at_company                int64
years_since_last_promotion      int64
years_with_curr_manager         int64
role_departament               object
remote_work                    object
dtype: object

In [23]:
rh.describe(include=object)

,age,attrition,business_travel,department,education_field,employee_number,gender,job_role,marital_status,over_time,total_working_years,role_departament,remote_work
count,1614,1614,842,302,869,1183,1614,1614,963,938,1088,302,1614
unique,54,2,3,3,6,1079,2,9,4,2,40,11,2
top,35,N,Travel_Rarely,Research & Development,Life Sciences,"482,0",M,Sales Executive,Married,N,"10,0",Sales Executive - Sales,Y
freq,84,1355,586,196,349,2,971,369,404,682,144,69,1000

In [24]:
rh.describe()

,daily_rate,distance_from_home,education,environment_satisfaction,hourly_rate,job_involvement,job_level,job_satisfaction,monthly_income,monthly_rate,num_companies_worked,percent_salary_hike,performance_rating,relationship_satisfaction,stock_option_level,training_times_last_year,work_life_balance,years_at_company,years_since_last_promotion,years_with_curr_manager
count,1490.000000,1614.000000,1614.000000,1614.000000,1530.000000,1614.000000,1614.000000,1614.000000,771.000000,1614.000000,1614.000000,1614.000000,1419.00000,1614.000000,1614.000000,1614.000000,1506.000000,1614.000000,1614.000000,1614.000000
mean,802.085235,4.527261,2.925031,4.294919,66.028105,2.739777,2.068154,2.738538,6477.686122,14284.495663,2.673482,15.165428,3.15081,2.704461,0.791202,2.809789,2.759628,7.132590,2.245973,4.220570
std,403.246954,14.591913,1.022357,6.993559,20.185954,0.711567,1.101344,1.106163,4766.119959,7110.414585,2.506152,3.648610,0.35799,1.079031,0.842396,1.297765,0.702622,6.124237,3.235665,3.562695
min,103.000000,-49.000000,1.000000,1.000000,30.000000,1.000000,1.000000,1.000000,1009.000000,2094.000000,0.000000,11.000000,3.00000,1.000000,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000
25%,468.250000,2.000000,2.000000,2.000000,48.000000,2.000000,1.000000,2.000000,2880.000000,8001.000000,1.000000,12.000000,3.00000,2.000000,0.000000,2.000000,2.000000,3.000000,0.000000,2.000000
50%,798.000000,5.000000,3.000000,3.000000,66.000000,3.000000,2.000000,3.000000,4859.000000,14248.500000,2.000000,14.000000,3.00000,3.000000,1.000000,3.000000,3.000000,5.000000,1.000000,3.000000
75%,1157.000000,11.000000,4.000000,4.000000,84.000000,3.000000,3.000000,4.000000,8230.500000,20364.000000,4.000000,18.000000,3.00000,4.000000,1.000000,3.000000,3.000000,9.000000,3.000000,7.000000
max,1499.000000,29.000000,5.000000,49.000000,100.000000,4.000000,5.000000,4.000000,19999.000000,26999.000000,9.000000,25.000000,4.00000,4.000000,3.000000,6.000000,4.000000,40.000000,15.000000,17.000000

In [25]:
rh

,age,attrition,business_travel,daily_rate,department,distance_from_home,education,education_field,employee_number,environment_satisfaction,gender,hourly_rate,job_involvement,job_level,job_role,job_satisfaction,marital_status,monthly_income,monthly_rate,num_companies_worked,over_time,percent_salary_hike,performance_rating,relationship_satisfaction,stock_option_level,total_working_years,training_times_last_year,work_life_balance,years_at_company,years_since_last_promotion,years_with_curr_manager,role_departament,remote_work
0,51,N,NaN,684.0,NaN,6,3,NaN,"162,0",1,M,51.0,3,5,Research Director,3,NaN,19537.0,6462,7,N,13,3.0,3,0,NaN,5,3.0,20,15,15,NaN,Y
1,52,N,NaN,699.0,NaN,1,4,Life Sciences,"259,0",3,M,65.0,2,5,Manager,3,NaN,19999.0,5678,0,NaN,14,3.0,1,1,"34,0",5,3.0,33,11,9,NaN,Y
2,42,N,Travel_Rarely,532.0,Research & Development,4,2,Technical Degree,"319,0",3,M,58.0,3,5,Manager,4,Married,19232.0,4933,1,N,11,3.0,4,0,"22,0",3,NaN,22,11,15,Manager - Research & Development,Y
3,47,N,Travel_Rarely,359.0,NaN,2,4,Medical,NaN,1,F,82.0,3,4,Research Director,3,Married,17169.0,26703,3,NaN,19,3.0,2,2,NaN,2,NaN,20,5,6,NaN,N
4,46,N,NaN,1319.0,NaN,3,3,Technical Degree,NaN,1,F,45.0,4,4,Sales Executive,1,Divorced,NaN,7739,2,N,12,3.0,4,1,NaN,5,3.0,19,2,8,NaN,N
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,36,Y,Travel_Rarely,530.0,NaN,3,1,Life Sciences,"967,0",3,M,51.0,2,3,Sales Executive,4,Married,10325.0,5518,1,NaN,11,NaN,1,1,NaN,6,3.0,16,3,7,NaN,N
1610,45,N,Non-Travel,805.0,NaN,4,2,NaN,"972,0",3,M,57.0,3,2,Laboratory Technician,2,NaN,4447.0,23163,1,NaN,12,3.0,2,0,NaN,5,2.0,9,0,8,NaN,Y
1611,39,N,Travel_Rarely,903.0,NaN,-13,5,NaN,NaN,13,M,41.0,4,3,Sales Executive,3,Single,NaN,2560,0,N,18,3.0,4,0,"9,0",3,3.0,8,0,7,NaN,Y
1612,36,N,Non-Travel,1229.0,NaN,8,4,Technical Degree,"990,0",1,M,84.0,3,2,Sales Executive,4,Divorced,NaN,25952,4,N,13,NaN,4,2,"12,0",3,3.0,7,0,7,NaN,Y
1613,46,N,NaN,566.0,NaN,7,2,Medical,NaN,4,M,75.0,3,3,Manufacturing Director,3,NaN,10845.0,24208,6,NaN,13,3.0,2,1,NaN,3,3.0,8,0,7,NaN,N

In [26]:
pd.set_option('display.max_rows', None)


rh['distance_from_home'].value_counts()

 2     217
 1     203
 10     86
 9      85
 8      81
 7      80
 3      79
 5      62
 6      61
 4      61
 16     30
 11     28
 15     27
 23     26
 29     25
 25     24
 24     24
 18     22
 26     22
 14     21
 12     21
 21     19
 17     19
 13     19
 20     18
 28     17
 22     16
 19     16
 27     13
-13     11
-12     11
-24     11
-18      8
-47      7
-35      7
-38      7
-19      6
-36      6
-14      6
-31      6
-26      6
-25      6
-42      6
-22      5
-45      5
-48      5
-10      5
-46      5
-16      5
-27      4
-30      4
-20      4
-29      4
-41      4
-32      4
-37      4
-17      3
-11      3
-15      3
-23      3
-33      3
-44      3
-21      2
-49      2
-28      2
-34      2
-43      2
-39      1
-40      1
Name: distance_from_home, dtype: int64

In [27]:
rh.to_csv('datos_limpios.csv')